CSI API ETABS v1
cFrameObj.GetEndLengthOffset Method
 Retrieves the frame object end offsets along the 1-axis of the object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetEndLengthOffset(
	string Name,
	ref bool AutoOffset,
	ref double Length1,
	ref double Length2,
	ref double RZ
)
Function GetEndLengthOffset (
	Name As String,
	ByRef AutoOffset As Boolean,
	ByRef Length1 As Double,
	ByRef Length2 As Double,
	ByRef RZ As Double
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim AutoOffset As Boolean
Dim Length1 As Double
Dim Length2 As Double
Dim RZ As Double
Dim returnValue As Integer
returnValue = instance.GetEndLengthOffset(Name,
	AutoOffset, Length1, Length2, RZ)
int GetEndLengthOffset(
	String^ Name,
	bool% AutoOffset,
	double% Length1,
	double% Length2,
	double% RZ
)
abstract GetEndLengthOffset :
        Name : string *
        AutoOffset : bool byref *
        Length1 : float byref *
        Length2 : float byref *
        RZ : float byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object.
AutoOffset
Type: System.Boolean
 If this item is True, the end length offsets are automatically determined by the program from object connectivity.
Length1
Type: System.Double
 The offset length along the 1-axis of the frame object at the I-End of the frame object. [L]
Length2
Type: System.Double
 The offset length along the 1-axis of the frame object at the J-End of the frame object. [L]
RZ
Type: System.Double
 The rigid zone factor. This is the fraction of the end offset length assumed to be rigid for bending and shear deformations.
Return Value
Type: Int32
 Returns zero if the offsets are successfully retrieved, otherwise it returns a nonzero value.
Remarks
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace